app/controllers/appointments_controller.rb

    def index
        @doctor = Doctor.find_by(id: params[:doctor_id])
        @appointments = @doctor.appointments.where(date: appointment_params[:appt_date])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1 AND "appointments"."date" = $2  [["doctor_id", 1], ["date", "2018-05-09"]]

    def create
        @appointment = Appointment.new(appointment_params)
        if @appointment.save
---
INSERT INTO "appointments" ("time", "date", "patient_first_name", "patient_last_name", "appointment_type", "doctor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def destroy
        @appointment = Appointment.find_by(id: params[:id])

        if @appointment.destroy
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 2]]