app/controllers/doctors_controller.rb

    def index
        @doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

    def show
        @doctor = Doctor.find_by(id: params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @doctor = Doctor.new(doctor_params)
        if @doctor.save
---
INSERT INTO "doctors" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Evan"], ["last_name", "Czako"], ["created_at", "2022-02-17 18:59:34.437712"], ["updated_at", "2022-02-17 18:59:34.437712"]]

    def destroy
        @doctor = Doctor.find_by(id: params[:id])
        if @doctor.destroy
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "doctors" WHERE "doctors"."id" = $1  [["id", 2]]